app/controllers/comments_controller.rb

SELECT * FROM "schedules" WHERE ("schedules"."id" = 1)
INSERT INTO "comments" ("created_at", "body", "updated_at", "schedule_id", "user_id") VALUES('2010-01-03 13:55:02', 'foobar', '2010-01-03 13:55:02', 1, NULL)
---
  def create
  	@schedule = Schedule.find(params[:schedule_id])
    @comment = @schedule.comments.build(params[:comment])
    @comment.user = current_user

    @comment.save

SELECT * FROM "schedules" WHERE ("schedules"."id" = 1)
UPDATE "comments" SET "updated_at" = '2010-01-04 00:08:41', "body" = 'asdasdgdsfdsfsa' WHERE "id" = 6
---
  def update
    @schedule = Schedule.find(params[:schedule_id])
    if @comment.update_attributes(params[:comment])

SELECT * FROM "schedules" WHERE ("schedules"."id" = 1)
DELETE FROM "comments" WHERE "id" = 1
---
  def destroy
    @schedule = Schedule.find(params[:schedule_id])
    @comment.destroy