app/controllers/items_controller.rb

SELECT * FROM "items" WHERE (description like '%50%') ORDER BY description LIMIT 20 OFFSET 0
SELECT count(*) AS count_all FROM "items"
---
  def index
      if params[:search] != nil
        @items = Item.search(params[:search],params[:page])

SELECT * FROM "strokes" WHERE ("strokes"."id" = 2)
SELECT * FROM "tools" WHERE ("tools"."id" = 3)
INSERT INTO "items" ("stroke_id", "tool_id", "description", "distance") VALUES(NULL, NULL, NULL, NULL)
---
  def create
    @item = Item.new(params[:item])

    @stroke = Stroke.find(@item.stroke_id)

    if @item.tool_id == nil
      @item.description = @item.distance.to_s + 'm ' + @stroke.name
    else
      @tool = Tool.find(@item.tool_id)
      @item.description = @item.distance.to_s + 'm ' + @stroke.name + ', ' + @tool.name
    end

    if @item.save

SELECT * FROM "items" WHERE ("items"."id" = 2)
---
  def edit
    @item = Item.find(params[:id])

SELECT * FROM "items" WHERE ("items"."id" = 2)
SELECT * FROM "strokes" WHERE ("strokes"."id" = 1)
SELECT * FROM "tools" WHERE ("tools"."id" = 2)
UPDATE "items" SET "distance" = 100, "tool_id" = 2, "stroke_id" = 4, "description" = '100m Backstroke, Paddels' WHERE "id" = 3
---
  def update
    @item = Item.find(params[:id])

    custom = params[:item]
    @stroke = Stroke.find(custom[:stroke_id])

    description = 'foo'
    if custom[:tool_id] == nil
      description = custom[:distance] + 'm ' + @stroke.name
    else
      @tool = Tool.find(custom[:tool_id])
      description = custom[:distance] + 'm ' + @stroke.name + ', ' + @tool.name
    end
    params[:item].merge!(:description => description)


    if @item.update_attributes(params[:item])

SELECT * FROM "items" WHERE ("items"."id" = 1)
DELETE FROM "items" WHERE "id" = 1
---
  def destroy
    @item = Item.find(params[:id])
    @item.destroy