app/controllers/schedules_controller.rb

  def show
  	@schedule = Schedule.find(params[:id])
---
SELECT * FROM "schedules" WHERE ("schedules"."id" = 1)

  def edit
    @schedule = Schedule.find(params[:id])
---
SELECT * FROM "schedules" WHERE ("schedules"."id" = 1)

  def update
    @schedule = Schedule.find(params[:id])
---
SELECT * FROM "schedules" WHERE ("schedules"."id" = 1)

  def destroy
    @schedule = Schedule.find(params[:id])
---
SELECT * FROM "schedules" WHERE ("schedules"."id" = 5)