app/controllers/schedules_controller.rb

SELECT "schedules".* FROM "schedules" INNER JOIN taggings ON schedules.id = taggings.taggable_id INNER JOIN tags ON taggings.tag_id = tags.id WHERE (tags.name='hund') ORDER BY schedules.updated_at DESC LIMIT 5 OFFSET 0
SELECT count(*) AS count_all FROM "schedules" INNER JOIN taggings ON schedules.id = taggings.taggable_id INNER JOIN tags ON taggings.tag_id = tags.id WHERE (tags.name='bär')
SELECT tags.*, COUNT(*) AS count FROM "tags" LEFT OUTER JOIN taggings ON tags.id = taggings.tag_id AND taggings.context = 'tags' INNER JOIN schedules ON schedules.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Schedule') GROUP BY tags.id, tags.name HAVING COUNT(*) > 0
---
  def index
      @tags = Schedule.tag_counts_on(:tags)
      if params[:tag] != nil
        params[:search] = nil
        @schedules = Schedule.withtag(params[:tag],params[:page])
      elsif params[:search] != nil
        @schedules = Schedule.search(params[:search],params[:page])

INSERT INTO "schedules" ("created_at", "title", "body", "updated_at", "user_id") VALUES('2010-01-03 23:44:07', 'Lorem ipsum', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Phasellus interdum elit a leo tempus quis rutrum sapien tincidunt. Duis mattis tincidunt risus sit amet tempus. Aenean aliquam imperdiet lectus ut placerat. Suspendisse lacinia ipsum ac dui porta mattis. Quisque fringilla commodo velit ut eleifend. Nam hendrerit orci at urna eleifend quis volutpat urna fringilla. Aliquam erat volutpat. Vestibulum varius nunc quis ligula venenatis pharetra. Sed nec dolor mi. Ut sit amet risus vitae est viverra sodales ut ut velit. Nullam nulla velit, convallis nec eleifend in, facilisis non turpis. Vestibulum ante ipsum primis in faucibus orci luctus et ultrices posuere cubilia Curae; Sed interdum, felis vitae aliquet fringilla, velit augue luctus felis, quis auctor dui est tempor orci.', '2010-01-03 23:44:07', 1)
SELECT * FROM "schedules" ORDER BY schedules.id DESC LIMIT 1
SELECT * FROM "schedulings" ORDER BY schedulings.id DESC LIMIT 1
INSERT INTO "schedulings" ("lft", "schedule_id", "wdh", "rank", "parent_id", "item_id", "rgt") VALUES(NULL, 1, 5, NULL, NULL, 4, NULL)
---
  def create
    @schedule.user = current_user
    if @schedule.save
      params[:schedule][:schedulings].each do |scheduling|
        scheduling.merge!(:schedule_id => @schedule.id)
        debugger
        Scheduling.create!(scheduling) unless scheduling.values.any?(&:blank?)

SELECT * FROM "schedulings" WHERE ("schedulings".collection_id = 1)
---
  def edit
    @schedulings = Scheduling.find(:schedule_id => params[:id])

SELECT * FROM "schedulings" WHERE ("schedulings".collection_id = 1)
UPDATE "schedules" SET "updated_at" = '2010-01-22 16:32:55', "body" = 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed mattis, sapien vel elementum ultricies, tellus odio facilisis felis, quis tempor ante mi at velit. Fusce interdum mi id eros consequat posuere. Nullam scelerisque imperdiet nunc, at dictum ante interdum ut. Praesent lacus purus, tristique nec scelerisque sit amet, imperdiet ac enim. Aenean sapien odio, blandit at luctus ut, porttitor ac lorem. Mauris purus nunc, fermentum sit amet egestas vitae, consequat mollis odio. Vestibulum lacus ipsum, commodo in bibendum vel, vehicula et tellus. Curabitur sollicitudin odio congue tellus porttitor tristique. Nullam commodo ultrices lacus, ut ullamcorper massa mattis a. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Nulla a lectus eget dui iaculis adipiscing. Donec malesuada felis erat. Etiam bibendum iaculis felis, eget aliquet nulla iaculis at. Integer faucibus erat at tellus pulvinar malesuada. Fusce egestas varius urna eu condimentum. Aliquam eu risus nec ante tincidunt aliquet. Nulla facilisi. Nullam commodo congue aliquam. Sed condimentum scelerisque dictum. Vivamus velit nibh, laoreet dapibus pulvinar in, facilisis sed est.' WHERE "id" = 1
DELETE FROM "schedulings" WHERE "id" = 9
---
  def update
    debugger
    @schedulings = Scheduling.find(:schedule_id => params[:id])
    @schedulings.each do |scheduling|
      params[:schedule][:schedulings][scheduling.id].merge!(scheduling.id)
      scheduling.update_attributes(params[:schedule][:schedulings])
    end
    params[:schedule].delete(:schedulings)

SELECT * FROM "schedulings" WHERE ("schedulings"."id" = 5)
---
  def destroy
    schedulings = Scheduling.find(:schedule_id => params[:id])