app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "openid_identifier", "password_salt", "persistence_token", "login_count", "roles_mask", "email") VALUES('2010-01-02 20:08:23', '273139dd131ed15b049befa39ce0b9ea1addaccb16d5d391dc8025ddef700c22d552ce23874c1a4f17eaedde39fc24c8d9937285933c3a0bd1567a800e18c4da', '2010-01-02 20:08:23', 'sch1zo', NULL, '_AUaSrIC2tSE4HfVdcQS', 'c9a74c9972f257e2c48f25abd6a9c3eb79ab973d16149ff1767de3fe9b984584190c3cd1c282c4fc584a94c6a498fe9e49358269ae1b7efb6792add67a010e83', 1, NULL, 'fo@blub.com')
---
  def create
    @user = User.new(params[:user])
    #set default role to registered_user
    @user.roles = ["registered_user"]
    @user.save do |result|

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
UPDATE "users" SET "password_salt" = 'EJb1CjtsA14QCvV9Vb_e', "crypted_password" = 'f82c72596a1e7b1eb6ee3b3a788d5942362ccc935159d8bd38f94d9957593ac0042a34d6e4ee1a288d13d7be10507ff6f5794685bf0e5a15f8c0533f0071ccb1', "persistence_token" = '53967be139fa566b2cbed093b0262618e93d6d1ae3443e08975de343d9e64bb43b3d373d178285e88038180791c2c55b305c182f7361a273c76439c8b3d6a43e', "login_count" = 2, "updated_at" = '2009-12-28 23:22:44' WHERE "id" = 1
---
  def update
    if params[:id] == "current"
	    @user =  current_user
    else
	    @user = User.find(params[:id])
    end
    @user.attributes = params[:user]
    @user.save do |result|

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
	def edit
	  if params[:id] == "current"
	    @user =  current_user
    else
	    @user = User.find(params[:id])

SELECT * FROM "users"
---
  def index
    @users = User.all